apache/nuttx/arch/mips/src/pic32mz/pic32mz-serial.c
static struct up_dev_s g_uart1priv =
{
  .uartbase  = PIC32MZ_UART1_K1BASE,
  .handler   = up_uart1_interrupt,
  .baud      = CONFIG_UART1_BAUD,
  .irqe      = PIC32MZ_IRQ_U1E,
  .irqrx     = PIC32MZ_IRQ_U1RX,
  .irqtx     = PIC32MZ_IRQ_U1TX,
  .parity    = CONFIG_UART1_PARITY,
  .bits      = CONFIG_UART1_BITS,
  .stopbits2 = CONFIG_UART1_2STOP,
};

static uart_dev_t g_uart1port =
{
  .recv      =
  {
    .size    = CONFIG_UART1_RXBUFSIZE,
    .buffer  = g_uart1rxbuffer,
  },
  .xmit      =
  {
    .size    = CONFIG_UART1_TXBUFSIZE,
    .buffer  = g_uart1txbuffer,
   },
  .ops       = &g_uart_ops,
  .priv      = &g_uart1priv,
};
#endif

#ifdef CONFIG_PIC32MZ_UART2
/* This describes the state of the PIC32MZ UART2 port. */

static struct up_dev_s g_uart2priv =
{
  .uartbase  = PIC32MZ_UART2_K1BASE,
  .handler   = up_uart2_interrupt,
  .baud      = CONFIG_UART2_BAUD,
  .irqe      = PIC32MZ_IRQ_U2E,
  .irqrx     = PIC32MZ_IRQ_U2RX,
  .irqtx     = PIC32MZ_IRQ_U2TX,
  .parity    = CONFIG_UART2_PARITY,
  .bits      = CONFIG_UART2_BITS,
  .stopbits2 = CONFIG_UART2_2STOP,
};

static uart_dev_t g_uart2port =
{
  .recv      =
  {
    .size    = CONFIG_UART2_RXBUFSIZE,
    .buffer  = g_uart2rxbuffer,
  },
  .xmit      =
  {
    .size    = CONFIG_UART2_TXBUFSIZE,
    .buffer  = g_uart2txbuffer,
   },
  .ops       = &g_uart_ops,
  .priv      = &g_uart2priv,
};
#endif

#ifdef CONFIG_PIC32MZ_UART3
/* This describes the state of the PIC32MZ UART3 port. */

static struct up_dev_s g_uart3priv =
{
  .uartbase  = PIC32MZ_UART3_K1BASE,
  .handler   = up_uart3_interrupt,
  .baud      = CONFIG_UART3_BAUD,
  .irqe      = PIC32MZ_IRQ_U3E,
  .irqrx     = PIC32MZ_IRQ_U3RX,
  .irqtx     = PIC32MZ_IRQ_U3TX,
  .parity    = CONFIG_UART3_PARITY,
  .bits      = CONFIG_UART3_BITS,
  .stopbits2 = CONFIG_UART3_2STOP,
};

static uart_dev_t g_uart3port =
{
  .recv      =
  {
    .size    = CONFIG_UART3_RXBUFSIZE,
    .buffer  = g_uart3rxbuffer,
  },
  .xmit      =
  {
    .size    = CONFIG_UART3_TXBUFSIZE,
    .buffer  = g_uart3txbuffer,
   },
  .ops       = &g_uart_ops,
  .priv      = &g_uart3priv,
};
#endif

#ifdef CONFIG_PIC32MZ_UART4
/* This describes the state of the PIC32MZ UART4 port. */

static struct up_dev_s g_uart4priv =
{
  .uartbase  = PIC32MZ_UART4_K1BASE,
  .handler   = up_uart4_interrupt,
  .baud      = CONFIG_UART4_BAUD,
  .irqe      = PIC32MZ_IRQ_U4E,
  .irqrx     = PIC32MZ_IRQ_U4RX,
  .irqtx     = PIC32MZ_IRQ_U4TX,
  .parity    = CONFIG_UART4_PARITY,
  .bits      = CONFIG_UART4_BITS,
  .stopbits2 = CONFIG_UART4_2STOP,
};

static uart_dev_t g_uart4port =
{
  .recv      =
  {
    .size    = CONFIG_UART4_RXBUFSIZE,
    .buffer  = g_uart4rxbuffer,
  },
  .xmit      =
  {
    .size    = CONFIG_UART4_TXBUFSIZE,
    .buffer  = g_uart4txbuffer,
   },
  .ops       = &g_uart_ops,
  .priv      = &g_uart4priv,
};
#endif

#ifdef CONFIG_PIC32MZ_UART5
/* This describes the state of the PIC32MZ UART5 port. */

static struct up_dev_s g_uart5priv =
{
  .uartbase  = PIC32MZ_UART5_K1BASE,
  .handler   = up_uart5_interrupt,
  .baud      = CONFIG_UART5_BAUD,
  .irqe      = PIC32MZ_IRQ_U5E,
  .irqrx     = PIC32MZ_IRQ_U5RX,
  .irqtx     = PIC32MZ_IRQ_U5TX,
  .parity    = CONFIG_UART5_PARITY,
  .bits      = CONFIG_UART5_BITS,
  .stopbits2 = CONFIG_UART5_2STOP,
};

static uart_dev_t g_uart5port =
{
  .recv      =
  {
    .size    = CONFIG_UART5_RXBUFSIZE,
    .buffer  = g_uart5rxbuffer,
  },
  .xmit      =
  {
    .size    = CONFIG_UART5_TXBUFSIZE,
    .buffer  = g_uart5txbuffer,
   },
  .ops       = &g_uart_ops,
  .priv      = &g_uart5priv,
};
#endif

#ifdef CONFIG_PIC32MZ_UART6
/* This describes the state of the PIC32MZ UART6 port. */

static struct up_dev_s g_uart6priv =
{
  .uartbase  = PIC32MZ_UART6_K1BASE,
  .handler   = up_uart6_interrupt,
  .baud      = CONFIG_UART6_BAUD,
  .irqe      = PIC32MZ_IRQ_U6E,
  .irqrx     = PIC32MZ_IRQ_U6RX,
  .irqtx     = PIC32MZ_IRQ_U6TX,
  .parity    = CONFIG_UART6_PARITY,
  .bits      = CONFIG_UART6_BITS,
  .stopbits2 = CONFIG_UART6_2STOP,
};

static uart_dev_t g_uart6port =
{
  .recv      =
  {
    .size    = CONFIG_UART6_RXBUFSIZE,
    .buffer  = g_uart6rxbuffer,
  },
  .xmit      =
  {
    .size    = CONFIG_UART6_TXBUFSIZE,
    .buffer  = g_uart6txbuffer,
   },
  .ops       = &g_uart_ops,
  .priv      = &g_uart6priv,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: up_serialin
 ****************************************************************************/

static inline uint32_t up_serialin(struct up_dev_s *priv, int offset)
{
  return getreg32(priv->uartbase + offset);
}

/****************************************************************************
 * Name: up_serialout
 ****************************************************************************/

static inline void up_serialout(struct up_dev_s *priv, int offset, uint32_t value)
{
  putreg32(value, priv->uartbase + offset);
}

/****************************************************************************
 * Name: up_restoreuartint
 ****************************************************************************/

static void up_restoreuartint(struct uart_dev_s *dev, uint8_t im)
{
  irqstate_t flags;

  /* Re-enable/re-disable interrupts corresponding to the state of bits in im */

  flags = irqsave();
  up_rxint(dev, RX_ENABLED(im));
  up_txint(dev, TX_ENABLED(im));
  irqrestore(flags);
}

/****************************************************************************
 * Name: up_disableuartint
 ****************************************************************************/

static void up_disableuartint(struct uart_dev_s *dev, uint8_t *im)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;
  irqstate_t flags;

  flags = irqsave();
  if (im)
   {
     *im = priv->im;
   }
  up_restoreuartint(dev, 0);
  irqrestore(flags);
}

/****************************************************************************
 * Name: up_setup
 *
 * Description:
 *   Configure the UART baud, bits, parity, etc. This method is called the
 *   first time that the serial port is opened.
 *
 ****************************************************************************/

